---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.HasDiagramSettings
source: html/39305b90-7e90-0393-032e-595a147d4ae2.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayStyle.HasDiagramSettings Method

If true style has diagram settings.

## Syntax (C#)
```csharp
public bool HasDiagramSettings()
```